src/InformationRegisters/ОчередьАктуализацииДопОбработок/ОчередьАктуализацииДопОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьАктуализацииДопОбработок</name>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обрабатывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьАктуализацииДопОбработок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(СтруктураПолей) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор();
	Запись.Обрабатывать = Истина;
	Запись.ОписаниеОшибки = "";
	Запись.ДатаПоследнейОбработки = Дата(1,1,1);
	Запись.ДатаЗаписи = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураПолей);
	
	Запись.Записать(Истина);

КонецПроцедуры

Процедура ОбновитьЗапись(ИдентификаторЗаписи, СтруктураПолей) Экспорт
	
	Набор = РегистрыСведений.ОчередьАктуализацииДопОбработок.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторЗаписи.Установить(ИдентификаторЗаписи);

	СтрокаНабора = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, СтруктураПолей);

	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
